// Для парней
let boyfirst = ["Тупой", "Конченный", "Ебанутый", "Лихоеблимудый", "Пизданутый", "Высохший", "Уебищный", "Умерший",
	"Толстомудый", "Опиздолюбый", "Мелкотроемудрый", "Хуйлолюбивый", "Хуячий", "Жирномногоканальный", "Аналочленный", 
	"Соплежуйный", "Жирнозадый", "Говножопый", "Мозгоебливый", "Сракомудрый",
	"Дохуяный", "Залупогрызущий", "Пидоросливый", "Заблеваный", "Нахуйбесполезный", "Плоскозадый", "Гомоебущий", 
	"Сраколюбивый", "Блядорасслабленный", "Заднепрошмандовочный", "Пердун", "Ебанутейший", "Кривожопый", "Засраный", 
	"Залупочес", "Еблоразрывающий", "Блудожаждущий", "Опиздолюбивый", "Забухающий", "Еблоушибленный", "Говноразбирающий",
	"Сракогрызущий", "Ебланский", "Лобковососущий", "Долбодятловый", "Еблизмоблядский", "Червивый", "Залупоглотательный",
	"Заднепродувочный", "Говнолизущий", "Мудокрутящий", "Пиздойебущий", "Сракометный", "Говнометный", "Жоповертящий",
	"Залуподроченный", "Сракопролазный", "Еблоблядун", "Жопоразрывающий", "Говножующий", "Пиздокрутящий", "Заднеебущий"]; // 80

let boysec = ["даун", "еблан", "пидорас", "хуйлан", "говноед", "конч", "шизик", "страходуроног", "аналомокроблядник", 
	"попечитель мочалок", "лизатель червей", "духопер", "блядохероблядник", "и плюшевый муфлон", "долбоблядскожопый", 
	"мозгоеб", "жоподыр", "блохолюб", "хуесос", "мудозвон",
	"пиздодыр", "залупочес", "жоподрочер", "говномет", "пиздолиз", "сракокрут", "хуеглот", "залупогрыз", "мудозвон",
	"пиздокрут", "сракогрыз", "хуеблет", "залупоед", "пиздоглот", "сракосос", "жопожуй", "пиздолюб", "хуеверт",
	"залупокрут", "говноед", "пиздодрочер", "сракоблядник", "жополюб", "пиздокрут", "хуемет", "залупогрыз", "мудодрочер",
	"пиздодыр", "сракогрыз", "жопоед", "пиздосос", "хуелюб", "залупоблядник", "говноеб", "пиздожуй", "сракокрут",
	"жопосос", "пиздолюб", "хуекрут", "залупогрыз", "мудоблядник", "пиздодрочер", "сракоглот"]; // 80

// Для девушек
let girlfirst = ["Тупая", "Конченная", "Ебанутая", "Блядскоеблиёбая", "Гнусная",
	"Жирная", "Токсичная", "Обтраханная", "Ебаная", "Задротская", "Горбатая", "Малость многострахоблядская", 
	"Хуйлодуроблядская", "Соплежопая", "Мудоскотоебая", "Засранная", "Мозгоебка", "Говноедная", "Пизданутая", 
	"Тупорылая",
	"Сраколюбивая", "Залупогрызущая", "Пидоросливная", "Заблеванная", "Нахуйбесполезная", "Плоскозадая", "Гомоебущая", 
	"Сраколюбивая", "Блядорасслабленная", "Заднепрошмандовочная", "Пердунья", "Ебанутейшая", "Кривожопая", "Засранная", 
	"Залупоческа", "Еблоразрывающая", "Блудожаждущая", "Опиздолюбивая", "Забуханная", "Еблоушибленная", "Говноразбирающая",
	"Сракогрызущая", "Ебланская", "Лобковососущая", "Долбодятловая", "Еблизмоблядская", "Червивая", "Залупоглотательная",
	"Заднепродувочная", "Говнолизущая", "Мудокрутящая", "Пиздойебущая", "Сракометная", "Говнометная", "Жоповертящая",
	"Залуподроченная", "Сракопролазная", "Еблоблядка", "Жопоразрывающая", "Говножующая", "Пиздокрутящая", "Заднеебущая"]; // 80

let girlsec = ["хуйня", "залупа", "манда", "шлюха", "лихохуярка", "блядь", 
	"залупоеблогнойница", "выхухоль", "пидораска", "ебланка", "нервостенничка", "мозгоебка", "дермоблядунья",
	"низтроехериница","приятельница червей", "хуесоска", "жоподырка", "блохолюбка", "мудозвонка", "сучка",
	"пиздодырка", "залупоческа", "жоподрочерка", "говнометка", "пиздолизка", "сракокрутка", "хуеглотка", "залупогрызка",
	"мудозвонка", "пиздокрутка", "сракогрызка", "хуеблетка", "залупоедка", "пиздоглотка", "сракососка", "жопожуйка",
	"пиздолюбка", "хуекрутка", "залупокрутка", "говноедка", "пиздодрочерка", "сракоблядница", "жополюбка", "пиздокрутка",
	"хуеметка", "залупогрызка", "мудодрочерка", "пиздодырка", "сракогрызка", "жопоедка", "пиздососка", "хуелюбка",
	"залупоблядница", "говноебка", "пиздожуйка", "сракокрутка", "жопососка", "пиздолюбка", "хуекрутка", "залупогрызка",
	"мудоблядница", "пиздодрочерка", "сракоглотка"]; // 80
let who = "boy";

function getRandomInt(max) {
	return Math.floor(Math.random() * max);
}

function generate() {
	let randomone = getRandomInt(20);
	let randomtwo = getRandomInt(20);

	if (who === "boy") {
		document.getElementById("mat").innerHTML = boyfirst[randomone] + " " + boysec[randomtwo];
	} else {
		document.getElementById("mat").innerHTML = girlfirst[randomone] + " " + girlsec[randomtwo];
	}
}

function boyselected() {
	who = "boy";
	generate();
	document.getElementById("whois").innerHTML = "Будем обзывать Парня";
}

function girlselected() {
	who = "girl";
	generate();
	document.getElementById("whois").innerHTML = "Будем обзывать Девушку";
}

document.addEventListener("DOMContentLoaded", () => {
	generate();
	document.getElementById("creator").innerHTML = "Сайт создал " + boyfirst[getRandomInt(20)] + " " + boysec[getRandomInt(20)] + " и Форкнула " + girlfirst[getRandomInt(20)] + " " + girlsec[getRandomInt(20)];
	document.getElementById("rand").innerHTML = "" + boysec[getRandomInt(20)];
});